package sort;

/**
 *希尔排序
 *
 针对直接插入排序的下效率问题，有人对次进行了改进与升级，这就是现在的希尔排序。希尔排序，也称递减增量排序算法，
 是插入排序的一种更高效的改进版本。希尔排序是非稳定排序算法。

 希尔排序是基于插入排序的以下两点性质而提出改进方法的：

 插入排序在对几乎已经排好序的数据操作时， 效率高， 即可以达到线性排序的效率
 但插入排序一般来说是低效的， 因为插入排序每次只能将数据移动一位


 对于直接插入排序问题，数据量巨大时。

 将数的个数设为n，取奇数k=n/2，将下标差值为k的数分为一组，构成有序序列。

 再取k=k/2 ，将下标差值为k的书分为一组，构成有序序列。

 重复第二步，直到k=1执行简单插入排序。


 代码实现：

 首先确定分的组数。

 然后对组中元素进行插入排序。

 然后将length/2，重复1,2步，直到length=0为止。


 其最坏时间复杂度依然为O(n²)，平均时间复杂度在增量选择适合时打到了O(n1.3)，最好为O（n）
 空间复杂度O（1）
 不稳定排序
 */
public class ShellSort {
    public void shellSort(int [] a){
        int len=a.length;//单独把数组长度拿出来，提高效率
        while(len!=0){
            len=len/2;
            for(int i=0;i<len;i++){//分组
                for(int j=i+len;j<a.length;j+=len){//元素从第二个开始
                    int k=j-len;//k为有序序列最后一位的位数
                    int temp=a[j];//要插入的元素
                    /*for(;k>=0&&temp<a[k];k-=len){
                        a[k+len]=a[k];
                    }*/
                    while(k>=0&&temp<a[k]){//从后往前遍历
                        a[k+len]=a[k];
                        k-=len;//向后移动len位
                    }
                    a[k+len]=temp;
                }
            }
        }
    }
}
